# Udemy 강의

## Section 4. 판다스 시리즈와 인덱스 객체

### Pandas Series

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv(r'C:\Users\A\Desktop\데잇걸즈\3. python\udemy\Course_Materials_Part1\Video_Lecture_NBs\titanic.csv')

In [3]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [4]:
# 아래와 같이 불러오면 series가 됨

titanic["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [5]:
# type 함수를 통해 series라는 것을 확인할 수 있음
# 이 series는 라벨이 있는 1차원 배열

type(titanic["age"])

pandas.core.series.Series

In [6]:
# 위의 배열에는 891개의 데이터가 있고, 이 데이터의 인덱스 라벨은 데이터프레임에 있는 인덱스와 같음

In [7]:
# 점 표기법으로도 확인 가능
# equals 함수를 통해 점 표기법과 [ ] 표기법 결과가 같음을 확인할 수 있음

titanic["age"].equals(titanic.age)

True

In [8]:
age = titanic["age"]

In [9]:
# 판다스에서는 데이터프레임과 시리즈가 대부분의 속성과 메소드를 공유
# 데이터프레임에만 적용되거나 시리즈에만 적용되는 메소드/속성은 거의 없음

In [10]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [11]:
age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

In [12]:
# 자료형을 표시해줌

age.dtype

dtype('float64')

In [13]:
age.shape

(891,)

In [14]:
len(age)

891

In [15]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [16]:
# 데이터프레임에는 info를 통해 전체적인 속성을 볼 수 있지만
# 시리즈에서는 info 속성이 없다는 오류가 뜸
# 따라서 info는 데이터프레임에서만 사용 가능

age.info()

AttributeError: 'Series' object has no attribute 'info'

In [17]:
# 시리즈를 데이터프레임으로 바꿔주는 메소드

age.to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [18]:
# 시리즈일 땐 info 사용이 불가했지만 데이터프레임으로 바꿔주고 info를 하면 실행됨

age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

#### Analyzing Numerical Series

- 수치형 Series와 그 데이터에 대해 다뤄보기

In [19]:
# age 컬럼 결과를 통해 자료는 실수형이라는 것을 알 수 있음

age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [20]:
# age 칼럼의 요약통계 확인
# null값을 제외한 데이터 수가 714로 표시
# null값은 177개
# 그 외에 평균, 표준편차, 최소, 최댓값 등 확인 가능

age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [21]:
# describe() 메소드로 얻어진 대부분의 통계값들은 별도로 구할 수도 있음

In [21]:
age.count()

714

In [22]:
# count와 size를 혼동하지 않기
# size는 모든 데이터값의 수를 반환하기 때문에 891이라는 결과가 나옴

age.size

891

In [23]:
# len도 size와 같은 결과를 보여줌
# 결측값을 포함한 모든 데이터의 수

len(age)

891

- 판다스 라이브러리의 장점은 판다스가 특별히 지저분하고 불확실한 실제 데이터를 잘 다룰 수 있도록 설계되어 있음
- 실제 데이터셋들은 많은 결측치를 갖고 있고, 판다스는 결측값을 처리하는데 매우 좋음

In [24]:
# 판다스의 sum() 메소드

age.sum()

21205.17

In [25]:
# 파이썬 내장함수

sum(age)

nan

- 파이썬 내장함수가 nan이 나오는 이유는 결측값을 어떻게 처리해야할지 모르기 때문
- 반면, 판다스의 sum() 메소드는 기본적으로 결측값을 제외하고 계산하도록 되어 있음
- 판다스의 sum()에 skipna=True가 기본값이기 때문
- 판다스의 메소드들에는 skipna=True가 기본 베이스로 대부분 결측값을 무시하고 계산함

In [26]:
age.mean()

29.69911764705882

In [27]:
age.median()

28.0

In [28]:
age.std()

14.526497332334044

In [29]:
age.min()

0.42

In [30]:
age.max()

80.0

In [31]:
# unique는 시리즈의 고유값을 반환
# 중복된 값을 제거하고 고유값만을 순서대로 보여줌
# 결측값도 nan이라고 나옴

age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [32]:
# 고유값의 수 확인

len(age.unique())

89

In [33]:
# nunique는 고유값의 수를 구하는 메소드
# len으로 구한 고유값 수와 1개 차이가 나는 이유는 nunique는 결측값을 제외하기 때문

age.nunique()

88

In [34]:
# 옵션에 dropna = False를 통해 결측값을 포함할 수 있음

age.nunique(dropna = False)

89

In [35]:
# 각 고유값들에 대한 빈도를 가장 높은 빈도부터 순서대로 보여줌

age.value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [36]:
# sort = False하면 원래 자료에 있는 순서대로 출력됨
# 디폴트는  sort = True

age.value_counts(sort = False)

31.0    17
15.0     5
44.0     9
10.0     2
53.0     1
        ..
30.5     2
60.0     4
56.0     4
20.5     1
54.0     8
Name: age, Length: 88, dtype: int64

In [38]:
# 결측값들을 분석에 포함할지 결정
# dropna = True가 디폴트

age.value_counts(dropna = False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
0.42       1
34.50      1
66.00      1
14.50      1
0.92       1
Name: age, Length: 89, dtype: int64

In [39]:
# 높은 빈도부터 순서대로 값을 보여주는 이유는 ascending = False가 디폴트이기 때문

age.value_counts(ascending=True)

0.67      1
14.50     1
36.50     1
74.00     1
24.50     1
         ..
19.00    25
30.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [40]:
# 판다스는 기본적으로 해당 함수를 통해 절대도수를 반환
# 하지만 상대도수를 반환하는 선택지도 있음
# 현재는 기본값들을 통한 절대도수

age.value_counts(sort = True, dropna = True, ascending = False, normalize = False)

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [41]:
# normalize = True로 상대도수 출력하기
# 24세 승객은 4.2%, 22세는 3.7% 등으로 상대도수를 확인할 수 있음

age.value_counts(sort = True, dropna = True, ascending = False, normalize = True)

24.00    0.042017
22.00    0.037815
18.00    0.036415
28.00    0.035014
19.00    0.035014
           ...
55.50    0.001401
74.00    0.001401
0.92     0.001401
70.50    0.001401
12.00    0.001401
Name: age, Length: 88, dtype: float64

In [42]:
# 그렇다면 판다스는 상대도수를 어떻게 계산할까?
# 24세 승객의 절대도수는 30, 상대도수는 4.2%
# 30을 결측값을 제외한 승객 수로 나누면 상대도수인 4.2가 나오게 됨

# 여기서 결측값을 제외한 승객 수로 나눠줬다는 것이 중요

30/age.count()

0.04201680672268908

In [43]:
# dropna = False 하게 되면 분모가 바뀌어 상대도수도 바뀜

age.value_counts(sort = True, dropna = False, ascending = False, normalize = True)

NaN      0.198653
24.00    0.033670
22.00    0.030303
18.00    0.029181
28.00    0.028058
           ...
0.42     0.001122
34.50    0.001122
66.00    0.001122
14.50    0.001122
0.92     0.001122
Name: age, Length: 89, dtype: float64

In [44]:
# 결측치를 포함한 상대도수 구하기

30/age.size

0.03367003367003367

In [45]:
# bins를 이용해 고유값들을 균일한 크기의 구간으로 묶어 도수 확인하기

# 16씩 나누어 구간이 설정된 것을 확인할 수 있음
# 346명의 승객이 16세에서 32세 사이
# 64세에서 80세 사이의 승객이 가장 적음

age.value_counts(sort = True, dropna = True, ascending = False, normalize = False, bins = 5)

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: age, dtype: int64

In [47]:
# 결론적으로 value_counts() 메소드 결과도 판다스 시리즈라는 것
# 절대도수, 상대도수들은 시리즈 값을 나타내고
# 왼쪽 열은 시리즈의 인덱스로 연령의 고유값임

### Analyzing non-numerical Series

- 문자열 데이터 등 비수치적 데이터들을 시리즈로 다루는 법

In [49]:
# 하계올림픽 메달 데이터셋

summer = pd.read_csv(r'C:\Users\A\Desktop\데잇걸즈\3. python\udemy\Course_Materials_Part1\Video_Lecture_NBs\summer.csv')

In [50]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [51]:
# 31165개의 데이터
# 총 9개의 컬럼
# Country 외엔 걸측치 있는 컬럼은 없음
# Year 컬럼만 정수형, 나머지 컬럼은 문자열로 구성

summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [52]:
# Athlete 컬럼만 시리즈로 얻어내기

athlete = summer["Athlete"]

In [53]:
type(athlete)

pandas.core.series.Series

In [54]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [55]:
# dtype('O')라는 것은 문자열이라는 뜻

athlete.dtype

dtype('O')

In [56]:
# 1차원 배열인 것 확인
# 시리즈는 항상 1차원 배열

athlete.shape

(31165,)

In [57]:
# count = 총 데이터 수
# unique = 고유값 수. 많은 선수들이 메달을 여러 차례 획득한 것을 알 수 있음
# top = 최빈값. 마이클 펠프스가 가장 많은 메달을 획득함
# freq = 최빈값의 수. 마이클 펠프스가 총 22번의 메달을 획득

athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [60]:
athlete.size

31165

In [59]:
# 이 열에는 결측값이 없는 것으로 확인
# 결측값이 있다면 athlete.size보다 작은 값이 나왔을 것

athlete.count()

31165

In [61]:
# 알파벳 순으로 가장 먼저 오는 이름을 반환

athlete.min()

'AABYE, Edgar'

In [62]:
# 고유값 확인
# 하계 올림픽에서 메달을 하나라도 받은 선수들

athlete.unique()

array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
       'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
      dtype=object)

In [63]:
# 총 22762명의 선수들이 하계 올림픽에서 메달 획득

len(athlete.unique())

22762

In [64]:
# 결측값이 없으므로 unique 값과 결과 동일

athlete.nunique()

22762

In [65]:
# 선수별로 메달을 몇 개 획득했는지 확인

athlete.value_counts()

PHELPS, Michael                 22
LATYNINA, Larisa                18
ANDRIANOV, Nikolay              15
ONO, Takashi                    13
MANGIAROTTI, Edoardo            13
                                ..
SILVINO, Anselmo                 1
BELLO, Fernando Pinto Coelho     1
OLSEN, Ejnar                     1
GRIMALDI, Martina                1
SPENGLER, Jörg                   1
Name: Athlete, Length: 22762, dtype: int64

In [66]:
# 상대도수 확인하기
# 가장 많은 메달을 획득한 마이클 펠프스는 전체 메달의 0.0706% 밖에 되지 않음

athlete.value_counts(normalize= True).head()

PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
ONO, Takashi            0.000417
MANGIAROTTI, Edoardo    0.000417
Name: Athlete, dtype: float64